/*
	모델링
    프로젝트 진행단계 : 현실세계의 업무를 컴퓨터 시스템으로 옮겨놓는 일련의 과정
    (대규모 프로그램을 작성 하기 위한 과정) 
    
    -- 복잡한 요구사항 (여러명이서 조합해서 만들어야 한다) 
    건물 : 계획 분석, 설계도 작업, 시공 
    
    소프트웨어 공학 : (폭포수 모델) 
    
    프로젝트 계획 
    업무 분석 - 더 중요        :  전체 공정에 50%
    시스템 설계  - 더 중요      :  전체 공정에 50%
    프로그램 구현 : 코딩 단계 
    테스트 
    유지보수 
    
    모델링 : 현실 세계에서 사용되는 작업이나 사물들을 DBMS의 데이터베이스 개체로 옮기기 위한 과정 
    직원 <----(물건을 산다)  고객 
    
    모델링 --> 회원 테이블, 직원 테이블, 구매 테이블, 물품 테이블 
    
    데이터베이스 모델링은 그케 3단계를 거쳐서 완성시키는 것이 보편적이다. 
    개념적 모델링, 논리적 모델링, 물리적 모델링으로 나눌 수 있다. 
    
    새로운 쇼핑몰 오픈한다고 가정 --> 간단한 모델링 해보기 (고객 방문 기록) 
    
    
    장부 --> 모델링 --> 엘자형 테이블 
 */